#+TITLE: word2vec

*** Sklearn 中的 One-hot Encoding

#+BEGIN_QUOTE
有如下三个特征属性：
性别：["male"，"female"]
地区：["Europe"，"US"，"Asia"]
浏览器：["Firefox"，"Chrome"，"Safari"，"Internet Explorer"]
#+END_QUOTE

对于上述的问题，性别的属性是二维的，同理，地区是三维的，浏览器则是四维的，这样，我们可以采用 One-Hot
编码的方式对上述的样本 “["male"，"US"，"Internet Explorer"]” 编码，“male”则对应着 [1，0]，
同理“US”对应着 [0，1，0]， “Internet Explorer” 对应着[0,0,0,1]。 则完整的特征数字化的结果为：
[1,0,0,1,0,0,0,0,1]。这样导致的一个结果就是数据会变得非常的稀疏。

#+BEGIN_SRC python
from sklearn import preprocessing

enc = preprocessing.OneHotEncoder()
enc.fit([[0,0,3],[1,1,0],[0,2,1],[1,0,2]])

array = enc.transform([[0,1,3]]).toarray()

print(array)
#+END_SRC

#+RESULTS:
: array([[1., 0., 0., 1., 0., 0., 0., 0., 1.]])

